In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [2]:
a=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['red','yellow','green','blue'])

In [3]:
a

        red    yellow     green      blue
A -1.132091  0.802209 -2.852862  1.338776
B  0.120337 -1.271633  2.255777 -1.301145
C -1.376235 -0.503326 -1.078118  1.591012
D  0.062641  1.695935 -0.229847  1.556040
E  0.436218  0.772708 -0.403723  2.462362

In [4]:
a=pd.DataFrame(np.random.randn(5,4),[1,2,3,4,5],columns=['Orange','Red','Yellow','Green'])
print(a)

     Orange       Red    Yellow     Green
1 -0.310207 -3.044993 -0.858894 -0.247099
2 -1.258387 -1.649283 -0.578699  1.842182
3  1.432067 -1.079683 -0.967429  0.327676
4  0.702839 -1.130609 -1.159327 -0.262595
5  0.229128  0.309432 -0.754484  0.390320

In [5]:
a.dtypes #checking datatype in a dataframe

Orange    float64
Red       float64
Yellow    float64
Green     float64
dtype: object

In [6]:
a['Green'] #Checking a column in a dataframe

1   -0.247099
2    1.842182
3    0.327676
4   -0.262595
5    0.390320
Name: Green, dtype: float64

In [7]:
type(a['Green'])

pandas.core.series.Series

In [8]:
type(a)

pandas.core.frame.DataFrame

In [9]:
a[['Green','Red']]

      Green       Red
1 -0.247099 -3.044993
2  1.842182 -1.649283
3  0.327676 -1.079683
4 -0.262595 -1.130609
5  0.390320  0.309432

In [10]:
type(a[['Green', 'Red']]) # checking datatype of 2 columns

pandas.core.frame.DataFrame

In [11]:
a['White']=a['Yellow'] # copying an existing column to a new column
a

     Orange       Red    Yellow     Green     White
1 -0.310207 -3.044993 -0.858894 -0.247099 -0.858894
2 -1.258387 -1.649283 -0.578699  1.842182 -0.578699
3  1.432067 -1.079683 -0.967429  0.327676 -0.967429
4  0.702839 -1.130609 -1.159327 -0.262595 -1.159327
5  0.229128  0.309432 -0.754484  0.390320 -0.754484

In [12]:
a['Sum of White to Orange']=a['White'] + a['Orange']
a

     Orange       Red    Yellow     Green     White  Sum of White to Orange
1 -0.310207 -3.044993 -0.858894 -0.247099 -0.858894               -1.169101
2 -1.258387 -1.649283 -0.578699  1.842182 -0.578699               -1.837085
3  1.432067 -1.079683 -0.967429  0.327676 -0.967429                0.464638
4  0.702839 -1.130609 -1.159327 -0.262595 -1.159327               -0.456488
5  0.229128  0.309432 -0.754484  0.390320 -0.754484               -0.525356

In [13]:
#slicing a DataFrame either through column or row

In [14]:
a.loc[2]

Orange                   -1.258387
Red                      -1.649283
Yellow                   -0.578699
Green                     1.842182
White                    -0.578699
Sum of White to Orange   -1.837085
Name: 2, dtype: float64

In [15]:
a.iloc[1]

Orange                   -1.258387
Red                      -1.649283
Yellow                   -0.578699
Green                     1.842182
White                    -0.578699
Sum of White to Orange   -1.837085
Name: 2, dtype: float64

In [16]:
b=pd.DataFrame(np.random.randn(3,2),['A', 'B','C'], ['Red', 'Blue'])
b

        Red      Blue
A -0.815630  0.241437
B -0.474138  0.154602
C  0.122136  0.081029

In [17]:
b.loc[['B','C']]

        Red      Blue
B -0.474138  0.154602
C  0.122136  0.081029

In [18]:
b.iloc[1]

Red    -0.474138
Blue    0.154602
Name: B, dtype: float64

In [19]:
b.iloc[0]

Red    -0.815630
Blue    0.241437
Name: A, dtype: float64

In [20]:
b.iloc[1:3, 0]

B   -0.474138
C    0.122136
Name: Red, dtype: float64

In [21]:
a

     Orange       Red    Yellow     Green     White  Sum of White to Orange
1 -0.310207 -3.044993 -0.858894 -0.247099 -0.858894               -1.169101
2 -1.258387 -1.649283 -0.578699  1.842182 -0.578699               -1.837085
3  1.432067 -1.079683 -0.967429  0.327676 -0.967429                0.464638
4  0.702839 -1.130609 -1.159327 -0.262595 -1.159327               -0.456488
5  0.229128  0.309432 -0.754484  0.390320 -0.754484               -0.525356

In [22]:
a.loc[[1,3],['Orange','White']]

     Orange     White
1 -0.310207 -0.858894
3  1.432067 -0.967429

In [23]:
a.loc[[2,4],['Green','Orange']]

      Green    Orange
2  1.842182 -1.258387
4 -0.262595  0.702839

In [24]:
a.drop(4)#droping a row

     Orange       Red    Yellow     Green     White  Sum of White to Orange
1 -0.310207 -3.044993 -0.858894 -0.247099 -0.858894               -1.169101
2 -1.258387 -1.649283 -0.578699  1.842182 -0.578699               -1.837085
3  1.432067 -1.079683 -0.967429  0.327676 -0.967429                0.464638
5  0.229128  0.309432 -0.754484  0.390320 -0.754484               -0.525356

In [25]:
a

     Orange       Red    Yellow     Green     White  Sum of White to Orange
1 -0.310207 -3.044993 -0.858894 -0.247099 -0.858894               -1.169101
2 -1.258387 -1.649283 -0.578699  1.842182 -0.578699               -1.837085
3  1.432067 -1.079683 -0.967429  0.327676 -0.967429                0.464638
4  0.702839 -1.130609 -1.159327 -0.262595 -1.159327               -0.456488
5  0.229128  0.309432 -0.754484  0.390320 -0.754484               -0.525356

In [26]:
a.drop(4, inplace=True) # To drop completely

In [27]:
a

     Orange       Red    Yellow     Green     White  Sum of White to Orange
1 -0.310207 -3.044993 -0.858894 -0.247099 -0.858894               -1.169101
2 -1.258387 -1.649283 -0.578699  1.842182 -0.578699               -1.837085
3  1.432067 -1.079683 -0.967429  0.327676 -0.967429                0.464638
5  0.229128  0.309432 -0.754484  0.390320 -0.754484               -0.525356

In [28]:
#To drop a column

In [29]:
a.drop('Red', axis=1)

     Orange    Yellow     Green     White  Sum of White to Orange
1 -0.310207 -0.858894 -0.247099 -0.858894               -1.169101
2 -1.258387 -0.578699  1.842182 -0.578699               -1.837085
3  1.432067 -0.967429  0.327676 -0.967429                0.464638
5  0.229128 -0.754484  0.390320 -0.754484               -0.525356

In [30]:
a

     Orange       Red    Yellow     Green     White  Sum of White to Orange
1 -0.310207 -3.044993 -0.858894 -0.247099 -0.858894               -1.169101
2 -1.258387 -1.649283 -0.578699  1.842182 -0.578699               -1.837085
3  1.432067 -1.079683 -0.967429  0.327676 -0.967429                0.464638
5  0.229128  0.309432 -0.754484  0.390320 -0.754484               -0.525356

In [31]:
a.drop('Red', axis=1, inplace=True)

In [32]:
a

     Orange    Yellow     Green     White  Sum of White to Orange
1 -0.310207 -0.858894 -0.247099 -0.858894               -1.169101
2 -1.258387 -0.578699  1.842182 -0.578699               -1.837085
3  1.432067 -0.967429  0.327676 -0.967429                0.464638
5  0.229128 -0.754484  0.390320 -0.754484               -0.525356

In [33]:
#SELECTION AND INDEXING OF DATAFRAME

In [34]:
from numpy.random import randn

In [35]:
E=pd.DataFrame(randn(5,4), ['a','b','c','d','e'],['Ife', 'Malik', 'Akin', 'Dare'])
E

        Ife     Malik      Akin      Dare
a -1.747446  1.418513 -0.540132 -0.200691
b  1.094334 -1.161144  0.277758 -0.442823
c  1.633659  1.635368 -1.058952  0.526210
d  1.266825  0.042180  0.453994  0.837204
e  0.304962 -0.923888  0.079191  1.140219

In [36]:
E>0

     Ife  Malik   Akin   Dare
a  False   True  False  False
b   True  False   True  False
c   True   True  False   True
d   True   True   True   True
e   True  False   True   True

In [37]:
C=E>0 # To store inside C    E[E>0]

In [38]:
C

     Ife  Malik   Akin   Dare
a  False   True  False  False
b   True  False   True  False
c   True   True  False   True
d   True   True   True   True
e   True  False   True   True

In [39]:
E[C]

        Ife     Malik      Akin      Dare
a       NaN  1.418513       NaN       NaN
b  1.094334       NaN  0.277758       NaN
c  1.633659  1.635368       NaN  0.526210
d  1.266825  0.042180  0.453994  0.837204
e  0.304962       NaN  0.079191  1.140219

In [40]:
E['Akin']>0

a    False
b     True
c    False
d     True
e     True
Name: Akin, dtype: bool

In [41]:
V=E[E['Akin']>0]
V

        Ife     Malik      Akin      Dare
b  1.094334 -1.161144  0.277758 -0.442823
d  1.266825  0.042180  0.453994  0.837204
e  0.304962 -0.923888  0.079191  1.140219

In [42]:
V=E[E['Akin']>0]['Dare']
V

b   -0.442823
d    0.837204
e    1.140219
Name: Dare, dtype: float64

In [43]:
V=E[E['Akin']>0][['Dare','Ife']]
V

       Dare       Ife
b -0.442823  1.094334
d  0.837204  1.266825
e  1.140219  0.304962

In [44]:
E[(E['Ife']>0) | (E['Malik']<0)]

        Ife     Malik      Akin      Dare
b  1.094334 -1.161144  0.277758 -0.442823
c  1.633659  1.635368 -1.058952  0.526210
d  1.266825  0.042180  0.453994  0.837204
e  0.304962 -0.923888  0.079191  1.140219

In [45]:
E[(E['Ife']>0) & (E['Akin']>0)]

        Ife     Malik      Akin      Dare
b  1.094334 -1.161144  0.277758 -0.442823
d  1.266825  0.042180  0.453994  0.837204
e  0.304962 -0.923888  0.079191  1.140219

In [46]:
#Multiplex indexing
import pandas as pd
import numpy as pd

In [47]:
O=["T1","T1","T1","T1","T2","T2","T2","T2"]
I=[1,2,3,4,1,2,3,4]
IMP=list(zip(O,I))
O

['T1', 'T1', 'T1', 'T1', 'T2', 'T2', 'T2', 'T2']

In [48]:
I

[1, 2, 3, 4, 1, 2, 3, 4]

In [49]:
IMP

[('T1', 1),
 ('T1', 2),
 ('T1', 3),
 ('T1', 4),
 ('T2', 1),
 ('T2', 2),
 ('T2', 3),
 ('T2', 4)]

In [55]:
import pandas as pd
v=pd.MultiIndex.from_tuples(IMP)
v

MultiIndex([('T1', 1),
            ('T1', 2),
            ('T1', 3),
            ('T1', 4),
            ('T2', 1),
            ('T2', 2),
            ('T2', 3),
            ('T2', 4)],
           )

In [56]:
G=pd.MultiIndex(levels=[["T1","T2"],[1,2,3,4]],codes=[[0,0,0,0,1,1,1,1],[0,1,2,2,0,1,2,1]])
G

MultiIndex([('T1', 1),
            ('T1', 2),
            ('T1', 3),
            ('T1', 3),
            ('T2', 1),
            ('T2', 2),
            ('T2', 3),
            ('T2', 2)],
           )

In [57]:
H=pd.DataFrame(np.random.randn(8,2), G,["X","Y"])
H

             X         Y
T1 1  0.824907 -1.984910
   2 -1.105195  0.165209
   3  1.103597 -1.059467
   3  1.206223  1.751299
T2 1 -1.034643  0.822487
   2 -0.291608  2.102152
   3 -1.119855  0.048769
   2  1.085085 -0.917281

In [58]:
H.iloc[2]

X    1.103597
Y   -1.059467
Name: (T1, 3), dtype: float64

In [59]:
a=pd.DataFrame(np.random.randn(6,2),columns=['X','Y'])

In [60]:
a

          X         Y
0 -0.650641  0.514345
1  2.038487 -2.232358
2  2.008901  1.141293
3  0.254631 -0.465501
4  0.829236 -0.803312
5 -0.645110 -0.005125

In [61]:
a.iloc[2]

X    2.008901
Y    1.141293
Name: 2, dtype: float64

In [62]:
b=pd.DataFrame(np.random.randn(6,2), index=['A','B','C','D','E','F'],columns=['X','Y'])

In [63]:
b

          X         Y
A  0.262031 -1.370366
B -0.727359  0.224608
C  0.363419  1.099713
D  0.262241  0.217549
E  0.513396 -0.278394
F -0.378432 -1.069331

In [64]:
b.loc['C']

X    0.363419
Y    1.099713
Name: C, dtype: float64

In [65]:
b.loc["B"]

X   -0.727359
Y    0.224608
Name: B, dtype: float64

In [66]:
b.loc['C','X'] #slicing

0.3634194783502548

In [67]:
H.loc['T1'].loc[2]

X   -1.105195
Y    0.165209
Name: 2, dtype: float64

In [68]:
H.loc['T1'].loc[2,'X']

-1.1051954835455342

In [69]:
H.index.names=['Types','Numbers']

In [70]:
H

                      X         Y
Types Numbers
T1    1        0.824907 -1.984910
      2       -1.105195  0.165209
      3        1.103597 -1.059467
      3        1.206223  1.751299
T2    1       -1.034643  0.822487
      2       -0.291608  2.102152
      3       -1.119855  0.048769
      2        1.085085 -0.917281

In [71]:
#Cross section

In [72]:
H.xs ('T2') # To return only T2

                X         Y
Numbers
1       -1.034643  0.822487
2       -0.291608  2.102152
3       -1.119855  0.048769
2        1.085085 -0.917281

In [73]:
H.xs(2, level='Numbers')

              X         Y
Types
T1    -1.105195  0.165209
T2    -0.291608  2.102152
T2     1.085085 -0.917281

In [74]:
H=pd.MultiIndex(levels=[["T1","T2"],[1,2,3,4]],codes=[[0,0,0,0,1,1,1,1],[0,1,2,2,0,1,2,1]])

In [75]:
H

MultiIndex([('T1', 1),
            ('T1', 2),
            ('T1', 3),
            ('T1', 3),
            ('T2', 1),
            ('T2', 2),
            ('T2', 3),
            ('T2', 2)],
           )

In [76]:
#Missing Data

In [77]:
Ik={'One':[10,np.nan,30],'Two':[np.nan, np.nan,50],'Three':[10,10,10]}
V=pd.DataFrame(Ik)
V

    One   Two  Three
0  10.0   NaN     10
1   NaN   NaN     10
2  30.0  50.0     10

In [78]:
V.dropna()

    One   Two  Three
2  30.0  50.0     10

In [79]:
V.dropna(axis=1)

   Three
0     10
1     10
2     10

In [80]:
V.dropna(thresh=2)

    One   Two  Three
0  10.0   NaN     10
2  30.0  50.0     10

In [81]:
V.fillna(value="something")

         One        Two  Three
0       10.0  something     10
1  something  something     10
2       30.0       50.0     10

In [82]:
#V['Two'].fillna(value=V['Two'].mean())

In [83]:
#V['One'].fillnaa(value=V['One'].mean())

In [84]:
#Groupby: It allows you to group rows based off of a column and perform an aggregate function on them

In [85]:
import pandas as pd
a={'Company':['Google','Google', 'Msft', 'Msft', 'FB', 'FB'],'Person':['Sam','Charlie', 'Amy', 'Vennessa', 'Carl','Sarah'],
  'Sales':[200,120,340,124,243,350]}
d=pd.DataFrame(a)
d

  Company    Person  Sales
0  Google       Sam    200
1  Google   Charlie    120
2    Msft       Amy    340
3    Msft  Vennessa    124
4      FB      Carl    243
5      FB     Sarah    350

In [86]:
print(d.columns)

Index(['Company', 'Person', 'Sales'], dtype='object')

In [87]:
a.keys()

dict_keys(['Company', 'Person', 'Sales'])

In [88]:
e=d.groupby('Company')

In [89]:
e.mean()

         Sales
Company
FB       296.5
Google   160.0
Msft     232.0

In [90]:
e.sum()

         Sales
Company
FB         593
Google     320
Msft       464

In [91]:
e.std()

              Sales
Company
FB        75.660426
Google    56.568542
Msft     152.735065

In [92]:
e.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [93]:
d.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [94]:
d.groupby('Company').count()

         Person  Sales
Company
FB            2      2
Google        2      2
Msft          2      2

In [95]:
d.groupby('Company').max()

           Person  Sales
Company
FB          Sarah    350
Google        Sam    200
Msft     Vennessa    340

In [96]:
d.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
Google   Charlie    120
Msft         Amy    124

In [97]:
d.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
Google    2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
Msft      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [98]:
d.groupby('Company').describe().transpose()

Company              FB      Google        Msft
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [99]:
d.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [100]:
import pandas as pd
import numpy as np

In [102]:
d=pd.DataFrame({'A':['A0', 'A1', 'A2','A3'],
               'B':['B0','B1', 'B2','B3'],
                'C':['C0','C1','C2','C3']},
               index=[0,1,2,3])

e=pd.DataFrame({'A':['A4', 'A5', 'A6','A7'],
               'B':['B4','B5', 'B6','B7'],
                'C':['C4','C5','C6','C7']},
               index=[0,1,2,3])

e

    A   B   C
0  A4  B4  C4
1  A5  B5  C5
2  A6  B6  C6
3  A7  B7  C7

In [103]:
d

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3

In [104]:
#Concatenation glue together dataframe. dimension must match along axis using pd.concat

In [108]:
f=pd.concat([d,e])

In [109]:
f

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
0  A4  B4  C4
1  A5  B5  C5
2  A6  B6  C6
3  A7  B7  C7

In [110]:
f=pd.concat([d,e],axis=1)
f

    A   B   C   A   B   C
0  A0  B0  C0  A4  B4  C4
1  A1  B1  C1  A5  B5  C5
2  A2  B2  C2  A6  B6  C6
3  A3  B3  C3  A7  B7  C7

In [111]:
#Merging: it allow you to mergedataframes together using a similar sql tables. Using pd.merge(data, 'inner', on=key)

In [125]:
d=pd.DataFrame({'Key1':['K0', 'K0', 'K1','K2'],
                'Key2':['K0', 'K1', 'K0','K1'],
                   'B':['B0','B1', 'B2','B3'],
                   'C':['C0','C1','C2','C3']})

e=pd.DataFrame({'Key1':['K0', 'K1', 'K1','K2'],
                'Key2':['K0', 'K0', 'K0','K0'],
                  'A0':['A0','A1', 'A2','A3'],
                  'D0':['D0','D1','D2','D3']})
pd.merge(d,e,on=['Key1','Key2'])

  Key1 Key2   B   C  A0  D0
0   K0   K0  B0  C0  A0  D0
1   K1   K0  B2  C2  A1  D1
2   K1   K0  B2  C2  A2  D2

In [126]:
pd.merge(d,e ,how='outer', on=['Key1', 'Key2'])

  Key1 Key2    B    C   A0   D0
0   K0   K0   B0   C0   A0   D0
1   K0   K1   B1   C1  NaN  NaN
2   K1   K0   B2   C2   A1   D1
3   K1   K0   B2   C2   A2   D2
4   K2   K1   B3   C3  NaN  NaN
5   K2   K0  NaN  NaN   A3   D3

In [127]:
pd.merge(d,e ,how='right', on=['Key1', 'Key2'])

  Key1 Key2    B    C  A0  D0
0   K0   K0   B0   C0  A0  D0
1   K1   K0   B2   C2  A1  D1
2   K1   K0   B2   C2  A2  D2
3   K2   K0  NaN  NaN  A3  D3

In [128]:
e

  Key1 Key2  A0  D0
0   K0   K0  A0  D0
1   K1   K0  A1  D1
2   K1   K0  A2  D2
3   K2   K0  A3  D3

In [129]:
d

  Key1 Key2   B   C
0   K0   K0  B0  C0
1   K0   K1  B1  C1
2   K1   K0  B2  C2
3   K2   K1  B3  C3

In [130]:
pd.merge(d,e ,how='left', on=['Key1', 'Key2'])

  Key1 Key2   B   C   A0   D0
0   K0   K0  B0  C0   A0   D0
1   K0   K1  B1  C1  NaN  NaN
2   K1   K0  B2  C2   A1   D1
3   K1   K0  B2  C2   A2   D2
4   K2   K1  B3  C3  NaN  NaN

In [133]:
d.merge(e ,how='cross')

   Key1_x Key2_x   B   C Key1_y Key2_y  A0  D0
0      K0     K0  B0  C0     K0     K0  A0  D0
1      K0     K0  B0  C0     K1     K0  A1  D1
2      K0     K0  B0  C0     K1     K0  A2  D2
3      K0     K0  B0  C0     K2     K0  A3  D3
4      K0     K1  B1  C1     K0     K0  A0  D0
5      K0     K1  B1  C1     K1     K0  A1  D1
6      K0     K1  B1  C1     K1     K0  A2  D2
7      K0     K1  B1  C1     K2     K0  A3  D3
8      K1     K0  B2  C2     K0     K0  A0  D0
9      K1     K0  B2  C2     K1     K0  A1  D1
10     K1     K0  B2  C2     K1     K0  A2  D2
11     K1     K0  B2  C2     K2     K0  A3  D3
12     K2     K1  B3  C3     K0     K0  A0  D0
13     K2     K1  B3  C3     K1     K0  A1  D1
14     K2     K1  B3  C3     K1     K0  A2  D2
15     K2     K1  B3  C3     K2     K0  A3  D3

In [134]:
#Joining: it is used for combining columns 0f 2 potentials intense d

In [140]:
v=pd.DataFrame({'A':['A0', 'A1', 'A2'],
               'B':['B0','B1', 'B2']},
                index=['K0','K1','K2'])
        

w=pd.DataFrame({'C':['C0', 'C2', 'C3'],
               'D':['D0','D2', 'D3']},
                index=['K0','K2','K3'])
w.join(v)

     C   D    A    B
K0  C0  D0   A0   B0
K2  C2  D2   A2   B2
K3  C3  D3  NaN  NaN

In [141]:
v.join(w,how = 'outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [142]:
#Operation in Pandas

In [143]:
df=pd.DataFrame({'T1':[1,2,3,4],
                 'T2':[419,473,421,50],
                 'T3':['abi', 'def', 'ghi','xyz']})
df.head()

   T1   T2   T3
0   1  419  abi
1   2  473  def
2   3  421  ghi
3   4   50  xyz

In [144]:
df.head()

   T1   T2   T3
0   1  419  abi
1   2  473  def
2   3  421  ghi
3   4   50  xyz

In [146]:
df['T2'].unique()

array([419, 473, 421,  50], dtype=int64)

In [147]:
df['T2'].nunique() # To check for occurance/count of unique value

4

In [148]:
df['T2'].value_counts()

419    1
473    1
421    1
50     1
Name: T2, dtype: int64

In [157]:
# df[df['T1']>2] & (df['T2']== 473)

TypeError: unsupported operand type(s) for &: 'str' and 'bool'

In [158]:
def times2(x):
    return x*2
df['T1'].apply(times2)

0    2
1    4
2    6
3    8
Name: T1, dtype: int64

In [160]:
df['T3'].apply(len)

0    3
1    3
2    3
3    3
Name: T3, dtype: int64

In [162]:
a = pd.DataFrame({'money': ['13.4j','5+0j','money']})
a['money'].apply(len)

0    5
1    4
2    5
Name: money, dtype: int64

In [163]:
df['T2'].apply(lambda x: x*2)

0    838
1    946
2    842
3    100
Name: T2, dtype: int64

In [164]:
df.drop(['T2'], axis=1, inplace=True)

In [165]:
df

   T1   T3
0   1  abi
1   2  def
2   3  ghi
3   4  xyz

In [166]:
df.columns

Index(['T1', 'T3'], dtype='object')

In [167]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [175]:
df['T3']=[7,2,6,2]

In [176]:
df

   T1  T3
0   1   7
1   2   2
2   3   6
3   4   2

In [177]:
df.sort_values("T3")

   T1  T3
1   2   2
3   4   2
2   3   6
0   1   7

In [178]:
df.isnull()

      T1     T3
0  False  False
1  False  False
2  False  False
3  False  False

In [185]:
data={'A':['foo','foo','foo', 'bar', 'bar','bar'],'B':['one','one','two','two','one','one'],'C':['x','y','x','y','x','y'],'D':[1,3,2,5,4,1]}
v=pd.DataFrame(data)
v
# df.pivot_table(v,values='D',index=['A','B'],columns=['C'])

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [188]:
T=pd.pivot_table(v,values='D',index=['A','B'],columns=['C'])

In [189]:
T

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN